ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/CBASS_INFRA1_GLB.xml
<module name="CBASS_INFRA1_GLB" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="GLB_REGS_pid" acronym="GLB_REGS_pid" offset="0x0" width="32" description="The Revision Register contains the major and minor revisions for the module.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID register scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business Unit: 10 = Processors" range="29 - 28" rwaccess="R"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1536" description="Module ID" range="27 - 16" rwaccess="R"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x20" description="RTL revision. Will vary depending on release." range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x1" description="Minor revision" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="GLB_REGS_destination_id" acronym="GLB_REGS_destination_id" offset="0x4" width="32" description="The Destination ID Register defines the destination ID value for error messages.">
		<bitfield id="DEST_ID" width="8" begin="7" end="0" resetval="0x0" description="The destination ID." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="GLB_REGS_exception_logging_control" acronym="GLB_REGS_exception_logging_control" offset="0x20" width="32" description="The Exception Logging Control Register controls the exception logging.">
		<bitfield id="DISABLE_PEND" width="1" begin="1" end="1" resetval="0x0" description="Disables logging pending when set." range="1" rwaccess="R/W"/> 
		<bitfield id="DISABLE_F" width="1" begin="0" end="0" resetval="0x0" description="Disables logging when set." range="0" rwaccess="R/W"/>
	</register>
	<register id="GLB_REGS_exception_logging_header0" acronym="GLB_REGS_exception_logging_header0" offset="0x24" width="32" description="The Exception Logging Header 0 Register contains the first word of the header.">
		<bitfield id="TYPE_F" width="8" begin="31" end="24" resetval="0x0" description="Type." range="31 - 24" rwaccess="R"/> 
		<bitfield id="SRC_ID" width="16" begin="23" end="8" resetval="0x0" description="Source ID." range="23 - 8" rwaccess="R"/> 
		<bitfield id="DEST_ID" width="8" begin="7" end="0" resetval="0x0" description="Destination ID." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="GLB_REGS_exception_logging_header1" acronym="GLB_REGS_exception_logging_header1" offset="0x28" width="32" description="The Exception Logging Header 1 Register contains the second word of the header.">
		<bitfield id="GROUP" width="8" begin="31" end="24" resetval="0x0" description="Group." range="31 - 24" rwaccess="R"/> 
		<bitfield id="CODE" width="8" begin="23" end="16" resetval="0x0" description="Code." range="23 - 16" rwaccess="R"/>
	</register>
	<register id="GLB_REGS_exception_logging_data0" acronym="GLB_REGS_exception_logging_data0" offset="0x2C" width="32" description="The Exception Logging Data 0 Register contains the first word of the data.">
		<bitfield id="ADDR_L" width="32" begin="31" end="0" resetval="0x0" description="Address lower 32 bits." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="GLB_REGS_exception_logging_data1" acronym="GLB_REGS_exception_logging_data1" offset="0x30" width="32" description="The Exception Logging Data 1 Register contains the second word of the data.">
		<bitfield id="ADDR_H" width="16" begin="15" end="0" resetval="0x0" description="Address upper 16 bits." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="GLB_REGS_exception_logging_data2" acronym="GLB_REGS_exception_logging_data2" offset="0x34" width="32" description="The Exception Logging Data 2 Register contains the third word of the data.">
		<bitfield id="ROUTEID" width="12" begin="27" end="16" resetval="0x0" description="Route ID." range="27 - 16" rwaccess="R"/> 
		<bitfield id="WRITE" width="1" begin="13" end="13" resetval="0x0" description="Write." range="13" rwaccess="R"/> 
		<bitfield id="READ" width="1" begin="12" end="12" resetval="0x0" description="Read." range="12" rwaccess="R"/> 
		<bitfield id="DEBUG" width="1" begin="11" end="11" resetval="0x0" description="Debug." range="11" rwaccess="R"/> 
		<bitfield id="CACHEABLE" width="1" begin="10" end="10" resetval="0x0" description="Cacheable." range="10" rwaccess="R"/> 
		<bitfield id="PRIV" width="1" begin="9" end="9" resetval="0x0" description="Priv." range="9" rwaccess="R"/> 
		<bitfield id="SECURE" width="1" begin="8" end="8" resetval="0x0" description="Secure." range="8" rwaccess="R"/> 
		<bitfield id="PRIV_ID" width="8" begin="7" end="0" resetval="0x0" description="Priv ID." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="GLB_REGS_exception_logging_data3" acronym="GLB_REGS_exception_logging_data3" offset="0x38" width="32" description="The Exception Logging Data 3 Register contains the fourth word of the data.">
		<bitfield id="BYTECNT" width="10" begin="9" end="0" resetval="0x0" description="Byte count." range="9 - 0" rwaccess="R"/>
	</register>
	<register id="GLB_REGS_exception_pend_set" acronym="GLB_REGS_exception_pend_set" offset="0x40" width="32" description="The Exception Logging Pending Set Register allows to set the pend signal.">
		<bitfield id="PEND_SET" width="1" begin="0" end="0" resetval="0x0" description="Write a 1 to set the exception pend signal." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="GLB_REGS_exception_pend_clear" acronym="GLB_REGS_exception_pend_clear" offset="0x44" width="32" description="The Exception Logging Pending Clear Register allows to clear the pend signal.">
		<bitfield id="PEND_CLR" width="1" begin="0" end="0" resetval="0x0" description="Write a 1 to clear the exception pend signal." range="0" rwaccess="R/W1TC"/>
	</register>
</module>